Revit 2027 API
EditorInteraction Constructor
 Construct a default interaction.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EditorInteraction()
Public Sub New
public:
EditorInteraction()
new : unit -> EditorInteraction
See Also
Reference
EditorInteraction Class
EditorInteraction Overload
Autodesk.Revit.UI Namespace